---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSet.ForwardIterator
source: html/a2fac2d0-19a0-2694-6392-0cc91b029830.htm
---
# Autodesk.Revit.DB.PaperSourceSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PaperSourceSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.